#include <QApplication>

#include "controller.hpp"
#include "core.hpp"
#include "dialog.hpp"

int main(int argc, char* argv[]) {
  QApplication a(argc, argv);
  Ctrl::Controller c{new Ui::MainDialog{}, new Core::CollatzProcessor{}};
  c.show();
  return a.exec();
}
// 1. По-перше, треба зберігати поточну кількість потоків в статичну змінну,
//     і потім переписувати цю змінну лише якщо ми вибрали іншу кількість
//     потоків ніж в попередній
//         раз. Це потрібно бо якщо часто тикати START, то рано чи пізно ф-цію
//         idealThreadNumber() видасть нам 0 потоків, і все піде по жопі ніби.
//         Але ще потестити з числом 150000.
//  Можливо в такій ситуації нам просто потрібно попробувати ще раз пізніше.
//  Або вивести повідомлення про те щоб юзер спробував ще раз.
// РІШЕННЯ: ЗРОБИТИ ДІЛЕЙ НА КНОПЦІ START ЩОБ ЇЇ НЕ МОЖНА БУЛО НАСТІЛЬКИ ШВИДКО
// ТИКАТИ
// бтв походу сигнали не можна абузити дуже швидко.
// 2. Обробити ситуацію коли в нашому векторі буде два числа в яких буде
// однаковий count
